package t6_ex;
/*
 * 대메뉴 1. 본봉테이블 2. 인사관리 3. 급여관리
 
   - 급여관리 프로그램 -
   1. 직위별 본봉테이블(salary) : 
   	 부장: 5000000, 과장: 4000000, 대리 : 3000000, 사원: 2000000
   	 - 직급과 본봉을 입력받아서 본봉 테이블에 저장한다.(수정,삭제)
   	 
   2. 인사관리테이블(insa)(등록/조회/수정/삭제) : 사번, 부서명, 성명, 직급, 나이, 입사일, 성별, 주소
   							- 같은게 있나?? count함수 이용..
   							- 직급은 직접 입력하지 말고 본봉테이블에서 가져와서 뿌려주고 입력받아서 넣기
   
   3. 급여관리 : 초과수당은 시간당 3만원으로 한다. 
    					공제액은 총 받은 금액의 10%로 한다.
    					실수령액 = 총받은 금액 - 공제액
    					사번 입력시 실수령액 나오는 식으로...
     
 */
public class HW {

}
